k6/results/tobe_order_payment.txt

         /\      Grafana   /?얄?  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ?얄? 
  /          \   |   (  |  (??  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: k6/order_payment.js
        output: InfluxDBv1 (http://localhost:8086)

     scenarios: (100.00%) 1 scenario, 300 max VUs, 2m0s max duration (incl. graceful stop):
              * default: Up to 300 looping VUs for 1m30s over 7 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (0m00.9s), 010/300 VUs, 0 complete and 0 interrupted iterations
default   [   1% ] 010/300 VUs  0m00.9s/1m30.0s

running (0m01.9s), 020/300 VUs, 0 complete and 0 interrupted iterations
default   [   2% ] 020/300 VUs  0m01.9s/1m30.0s

running (0m02.9s), 029/300 VUs, 10 complete and 0 interrupted iterations
default   [   3% ] 029/300 VUs  0m02.9s/1m30.0s

running (0m03.9s), 039/300 VUs, 17 complete and 0 interrupted iterations
default   [   4% ] 039/300 VUs  0m03.9s/1m30.0s

running (0m04.9s), 049/300 VUs, 36 complete and 0 interrupted iterations
default   [   5% ] 049/300 VUs  0m04.9s/1m30.0s

running (0m05.9s), 059/300 VUs, 55 complete and 0 interrupted iterations
default   [   7% ] 059/300 VUs  0m05.9s/1m30.0s

running (0m06.9s), 069/300 VUs, 85 complete and 0 interrupted iterations
default   [   8% ] 069/300 VUs  0m06.9s/1m30.0s

running (0m07.9s), 079/300 VUs, 113 complete and 0 interrupted iterations
default   [   9% ] 079/300 VUs  0m07.9s/1m30.0s

running (0m08.9s), 089/300 VUs, 152 complete and 0 interrupted iterations
default   [  10% ] 089/300 VUs  0m08.9s/1m30.0s

running (0m09.9s), 099/300 VUs, 189 complete and 0 interrupted iterations
default   [  11% ] 099/300 VUs  0m09.9s/1m30.0s

running (0m10.9s), 109/300 VUs, 236 complete and 0 interrupted iterations
default   [  12% ] 109/300 VUs  0m10.9s/1m30.0s

running (0m11.9s), 119/300 VUs, 285 complete and 0 interrupted iterations
default   [  13% ] 119/300 VUs  0m11.9s/1m30.0s

running (0m12.9s), 129/300 VUs, 342 complete and 0 interrupted iterations
default   [  14% ] 129/300 VUs  0m12.9s/1m30.0s

running (0m13.9s), 139/300 VUs, 402 complete and 0 interrupted iterations
default   [  15% ] 139/300 VUs  0m13.9s/1m30.0s

running (0m14.9s), 149/300 VUs, 470 complete and 0 interrupted iterations
default   [  17% ] 149/300 VUs  0m14.9s/1m30.0s

running (0m15.9s), 159/300 VUs, 537 complete and 0 interrupted iterations
default   [  18% ] 159/300 VUs  0m15.9s/1m30.0s

running (0m16.9s), 169/300 VUs, 616 complete and 0 interrupted iterations
default   [  19% ] 169/300 VUs  0m16.9s/1m30.0s

running (0m17.9s), 179/300 VUs, 687 complete and 0 interrupted iterations
default   [  20% ] 179/300 VUs  0m17.9s/1m30.0s

running (0m18.9s), 189/300 VUs, 782 complete and 0 interrupted iterations
default   [  21% ] 189/300 VUs  0m18.9s/1m30.0s

running (0m19.9s), 199/300 VUs, 866 complete and 0 interrupted iterations
default   [  22% ] 199/300 VUs  0m19.9s/1m30.0s

running (0m20.9s), 209/300 VUs, 966 complete and 0 interrupted iterations
default   [  23% ] 209/300 VUs  0m20.9s/1m30.0s

running (0m21.9s), 219/300 VUs, 1061 complete and 0 interrupted iterations
default   [  24% ] 219/300 VUs  0m21.9s/1m30.0s

running (0m22.9s), 229/300 VUs, 1170 complete and 0 interrupted iterations
default   [  25% ] 229/300 VUs  0m22.9s/1m30.0s

running (0m23.9s), 239/300 VUs, 1271 complete and 0 interrupted iterations
default   [  27% ] 239/300 VUs  0m23.9s/1m30.0s

running (0m24.9s), 249/300 VUs, 1395 complete and 0 interrupted iterations
default   [  28% ] 249/300 VUs  0m24.9s/1m30.0s

running (0m25.9s), 259/300 VUs, 1503 complete and 0 interrupted iterations
default   [  29% ] 259/300 VUs  0m25.9s/1m30.0s

running (0m26.9s), 269/300 VUs, 1634 complete and 0 interrupted iterations
default   [  30% ] 269/300 VUs  0m26.9s/1m30.0s

running (0m27.9s), 279/300 VUs, 1757 complete and 0 interrupted iterations
default   [  31% ] 279/300 VUs  0m27.9s/1m30.0s

running (0m28.9s), 289/300 VUs, 1897 complete and 0 interrupted iterations
default   [  32% ] 289/300 VUs  0m28.9s/1m30.0s

running (0m29.9s), 299/300 VUs, 2030 complete and 0 interrupted iterations
default   [  33% ] 299/300 VUs  0m29.9s/1m30.0s

running (0m30.9s), 300/300 VUs, 2177 complete and 0 interrupted iterations
default   [  34% ] 300/300 VUs  0m30.9s/1m30.0s

running (0m31.9s), 300/300 VUs, 2325 complete and 0 interrupted iterations
default   [  35% ] 300/300 VUs  0m31.9s/1m30.0s

running (0m32.9s), 300/300 VUs, 2464 complete and 0 interrupted iterations
default   [  37% ] 300/300 VUs  0m32.9s/1m30.0s

running (0m33.9s), 300/300 VUs, 2618 complete and 0 interrupted iterations
default   [  38% ] 300/300 VUs  0m33.9s/1m30.0s

running (0m34.9s), 300/300 VUs, 2757 complete and 0 interrupted iterations
default   [  39% ] 300/300 VUs  0m34.9s/1m30.0s

running (0m35.9s), 300/300 VUs, 2912 complete and 0 interrupted iterations
default   [  40% ] 300/300 VUs  0m35.9s/1m30.0s

running (0m36.9s), 300/300 VUs, 3045 complete and 0 interrupted iterations
default   [  41% ] 300/300 VUs  0m36.9s/1m30.0s

running (0m37.9s), 300/300 VUs, 3209 complete and 0 interrupted iterations
default   [  42% ] 300/300 VUs  0m37.9s/1m30.0s

running (0m38.9s), 300/300 VUs, 3339 complete and 0 interrupted iterations
default   [  43% ] 300/300 VUs  0m38.9s/1m30.0s

running (0m39.9s), 300/300 VUs, 3498 complete and 0 interrupted iterations
default   [  44% ] 300/300 VUs  0m39.9s/1m30.0s

running (0m40.9s), 300/300 VUs, 3634 complete and 0 interrupted iterations
default   [  45% ] 300/300 VUs  0m40.9s/1m30.0s

running (0m41.9s), 300/300 VUs, 3794 complete and 0 interrupted iterations
default   [  47% ] 300/300 VUs  0m41.9s/1m30.0s

running (0m42.9s), 300/300 VUs, 3929 complete and 0 interrupted iterations
default   [  48% ] 300/300 VUs  0m42.9s/1m30.0s

running (0m43.9s), 300/300 VUs, 4087 complete and 0 interrupted iterations
default   [  49% ] 300/300 VUs  0m43.9s/1m30.0s

running (0m44.9s), 300/300 VUs, 4222 complete and 0 interrupted iterations
default   [  50% ] 300/300 VUs  0m44.9s/1m30.0s

running (0m45.9s), 300/300 VUs, 4379 complete and 0 interrupted iterations
default   [  51% ] 300/300 VUs  0m45.9s/1m30.0s

running (0m46.9s), 300/300 VUs, 4518 complete and 0 interrupted iterations
default   [  52% ] 300/300 VUs  0m46.9s/1m30.0s

running (0m47.9s), 300/300 VUs, 4671 complete and 0 interrupted iterations
default   [  53% ] 300/300 VUs  0m47.9s/1m30.0s

running (0m48.9s), 300/300 VUs, 4811 complete and 0 interrupted iterations
default   [  54% ] 300/300 VUs  0m48.9s/1m30.0s

running (0m49.9s), 300/300 VUs, 4961 complete and 0 interrupted iterations
default   [  55% ] 300/300 VUs  0m49.9s/1m30.0s

running (0m50.9s), 300/300 VUs, 5108 complete and 0 interrupted iterations
default   [  57% ] 300/300 VUs  0m50.9s/1m30.0s

running (0m51.9s), 300/300 VUs, 5254 complete and 0 interrupted iterations
default   [  58% ] 300/300 VUs  0m51.9s/1m30.0s

running (0m52.9s), 300/300 VUs, 5401 complete and 0 interrupted iterations
default   [  59% ] 300/300 VUs  0m52.9s/1m30.0s

running (0m53.9s), 300/300 VUs, 5549 complete and 0 interrupted iterations
default   [  60% ] 300/300 VUs  0m53.9s/1m30.0s

running (0m54.9s), 300/300 VUs, 5686 complete and 0 interrupted iterations
default   [  61% ] 300/300 VUs  0m54.9s/1m30.0s

running (0m55.9s), 300/300 VUs, 5844 complete and 0 interrupted iterations
default   [  62% ] 300/300 VUs  0m55.9s/1m30.0s

running (0m56.9s), 300/300 VUs, 5983 complete and 0 interrupted iterations
default   [  63% ] 300/300 VUs  0m56.9s/1m30.0s

running (0m57.9s), 300/300 VUs, 6139 complete and 0 interrupted iterations
default   [  64% ] 300/300 VUs  0m57.9s/1m30.0s

running (0m58.9s), 300/300 VUs, 6279 complete and 0 interrupted iterations
default   [  65% ] 300/300 VUs  0m58.9s/1m30.0s

running (0m59.9s), 300/300 VUs, 6435 complete and 0 interrupted iterations
default   [  67% ] 300/300 VUs  0m59.9s/1m30.0s

running (1m00.9s), 299/300 VUs, 6570 complete and 0 interrupted iterations
default   [  68% ] 299/300 VUs  1m00.9s/1m30.0s

running (1m01.9s), 283/300 VUs, 6734 complete and 0 interrupted iterations
default   [  69% ] 283/300 VUs  1m01.9s/1m30.0s

running (1m02.9s), 265/300 VUs, 6867 complete and 0 interrupted iterations
default   [  70% ] 265/300 VUs  1m02.9s/1m30.0s

running (1m03.9s), 238/300 VUs, 7011 complete and 0 interrupted iterations
default   [  71% ] 238/300 VUs  1m03.9s/1m30.0s

running (1m04.9s), 222/300 VUs, 7128 complete and 0 interrupted iterations
default   [  72% ] 222/300 VUs  1m04.9s/1m30.0s

running (1m05.9s), 204/300 VUs, 7244 complete and 0 interrupted iterations
default   [  73% ] 204/300 VUs  1m05.9s/1m30.0s

running (1m06.9s), 181/300 VUs, 7347 complete and 0 interrupted iterations
default   [  74% ] 181/300 VUs  1m06.9s/1m30.0s

running (1m07.9s), 158/300 VUs, 7446 complete and 0 interrupted iterations
default   [  75% ] 158/300 VUs  1m07.9s/1m30.0s

running (1m08.9s), 144/300 VUs, 7527 complete and 0 interrupted iterations
default   [  77% ] 144/300 VUs  1m08.9s/1m30.0s

running (1m09.9s), 120/300 VUs, 7601 complete and 0 interrupted iterations
default   [  78% ] 120/300 VUs  1m09.9s/1m30.0s

running (1m10.9s), 104/300 VUs, 7670 complete and 0 interrupted iterations
default   [  79% ] 104/300 VUs  1m10.9s/1m30.0s

running (1m11.9s), 097/300 VUs, 7721 complete and 0 interrupted iterations
default   [  80% ] 097/300 VUs  1m11.9s/1m30.0s

running (1m12.9s), 092/300 VUs, 7774 complete and 0 interrupted iterations
default   [  81% ] 092/300 VUs  1m12.9s/1m30.0s

running (1m13.9s), 086/300 VUs, 7818 complete and 0 interrupted iterations
default   [  82% ] 086/300 VUs  1m13.9s/1m30.0s

running (1m14.9s), 080/300 VUs, 7865 complete and 0 interrupted iterations
default   [  83% ] 080/300 VUs  1m14.9s/1m30.0s

running (1m15.9s), 077/300 VUs, 7903 complete and 0 interrupted iterations
default   [  84% ] 077/300 VUs  1m15.9s/1m30.0s

running (1m16.9s), 070/300 VUs, 7943 complete and 0 interrupted iterations
default   [  85% ] 070/300 VUs  1m16.9s/1m30.0s

running (1m17.9s), 066/300 VUs, 7980 complete and 0 interrupted iterations
default   [  87% ] 066/300 VUs  1m17.9s/1m30.0s

running (1m18.9s), 062/300 VUs, 8011 complete and 0 interrupted iterations
default   [  88% ] 062/300 VUs  1m18.9s/1m30.0s

running (1m19.9s), 058/300 VUs, 8045 complete and 0 interrupted iterations
default   [  89% ] 058/300 VUs  1m19.9s/1m30.0s

running (1m20.9s), 052/300 VUs, 8073 complete and 0 interrupted iterations
default   [  90% ] 052/300 VUs  1m20.9s/1m30.0s

running (1m21.9s), 044/300 VUs, 8103 complete and 0 interrupted iterations
default   [  91% ] 044/300 VUs  1m21.9s/1m30.0s

running (1m22.9s), 041/300 VUs, 8124 complete and 0 interrupted iterations
default   [  92% ] 041/300 VUs  1m22.9s/1m30.0s

running (1m23.9s), 034/300 VUs, 8147 complete and 0 interrupted iterations
default   [  93% ] 034/300 VUs  1m23.9s/1m30.0s

running (1m24.9s), 031/300 VUs, 8165 complete and 0 interrupted iterations
default   [  94% ] 031/300 VUs  1m24.9s/1m30.0s

running (1m25.9s), 027/300 VUs, 8179 complete and 0 interrupted iterations
default   [  95% ] 027/300 VUs  1m25.9s/1m30.0s

running (1m26.9s), 019/300 VUs, 8196 complete and 0 interrupted iterations
default   [  97% ] 019/300 VUs  1m26.9s/1m30.0s

running (1m27.9s), 016/300 VUs, 8206 complete and 0 interrupted iterations
default   [  98% ] 016/300 VUs  1m27.9s/1m30.0s

running (1m28.9s), 012/300 VUs, 8214 complete and 0 interrupted iterations
default   [  99% ] 012/300 VUs  1m28.9s/1m30.0s

running (1m29.9s), 006/300 VUs, 8222 complete and 0 interrupted iterations
default   [ 100% ] 006/300 VUs  1m29.9s/1m30.0s

running (1m30.9s), 002/300 VUs, 8226 complete and 0 interrupted iterations
default ??[ 100% ] 006/300 VUs  1m30s


  ??THRESHOLDS 

    http_req_duration
    ??'p(99)<1000' p(99)=80.67ms

    http_req_failed
    ??'rate<0.01' rate=0.00%


  ??TOTAL RESULTS 

    checks_total.......: 20502   224.413131/s
    checks_succeeded...: 100.00% 20502 out of 20502
    checks_failed......: 0.00%   0 out of 20502

    ???멸린?곹뭹 議고쉶 ?깃났
    ???멸린?곹뭹 ?곗씠???뺤씤
    ???붿븸 異⑹쟾 ?깃났
    ???붿븸 議고쉶 ?깃났
    ??二쇰Ц ?앹꽦 ?깃났
    ??二쇰Ц ID ?뺤씤
    ??二쇰Ц ?곹깭 議고쉶 ?깃났
    ??二쇰Ц ?꾨즺 ?뺤씤

    HTTP
    http_req_duration..............: avg=13.12ms min=1.6ms med=5.45ms max=435.35ms p(50)=5.45ms p(90)=33.6ms p(95)=45.77ms p(99)=80.67ms p(99.9)=188.65ms
      { expected_response:true }...: avg=13.12ms min=1.6ms med=5.45ms max=435.35ms p(50)=5.45ms p(90)=33.6ms p(95)=45.77ms p(99)=80.67ms p(99.9)=188.65ms
    http_req_failed................: 0.00%  0 out of 11912
    http_reqs......................: 11912  130.387729/s

    EXECUTION
    iteration_duration.............: avg=2.04s   min=2s    med=2s     max=3.48s    p(50)=2s     p(90)=2.05s  p(95)=2.07s   p(99)=3.14s   p(99.9)=3.3s    
    iterations.....................: 8228   90.062981/s
    vus............................: 2      min=2          max=300
    vus_max........................: 300    min=300        max=300

    NETWORK
    data_received..................: 4.2 MB 46 kB/s
    data_sent......................: 1.2 MB 14 kB/s



running (1m31.4s), 000/300 VUs, 8228 complete and 0 interrupted iterations
default ??[ 100% ] 000/300 VUs  1m30s